In [ ]:
# 판다스 (pandas)
데이터를 관리하기 위한 모듈로 시리즈와 데이터 프레임을 제공함

In [8]:
import numpy as np

In [7]:
import pandas as pd

In [ ]:
pip install pandas

In [ ]:
# 시리즈 (series)
데이터를 한줄로 담는 자료 구조
리스트와 다른 점은 데이터에 이름표를 붙일 수 있다 (index)

In [12]:
# 시리즈 생성
s = pd.Series([1,2,3,4])
print(s)
# 인덱스가 자동으로 설정됨 (0~3)
# 시리즈의 인덱스 확인

0    1
1    2
2    3
3    4
dtype: int64

In [11]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
# 인덱스를 직접 설정하여 시리즈 생성
s = pd.Series([1,2,3], index=['a','b','c'])
s

a    1
b    2
c    3
dtype: int64

In [15]:
s.index

Index(['a', 'b', 'c'], dtype='object')

In [ ]:
# 시리즈에서 값 꺼내기
# 값을 찾는 방법: 인덱스의 이름과 위치
# loc: 인덱스 이름으로 데이터를 찾는다
# iloc: 인덱스 위치로 데이터를 찾는다
# 대괄호[]: 인덱스 이름으로 데이터를 찾는다

In [21]:
print(s)
# 이 시리즈의 인덱스 이름: a, b, c
# 이 시리즈의 인덱스 위치: 0, 1, 2

# 인덱스 이름으로 숫자 1 꺼내기
s.loc['a']

# 인덱스 이름으로 숫자 2 꺼내기
s['b']

# 인덱스 이름으로 숫자 3 꺼내기
s.iloc[2]

a    1
b    2
c    3
dtype: int64

np.int64(3)

In [28]:
s
# 1을 0으로 변경
# 찾기 -> 변경
s.loc['a'] = 0

# 3을 99로 변경
s['c'] = 99
s

a     0
b     2
c    99
dtype: int64

In [ ]:
# 데이터 프레임
# 표 형식의 2차원 데이터를 담기 위한 자료 구조
# 데이터 프레임 생성

In [32]:
# 도시별 인구 데이터를 담은 데이터 프레임 생성
# 데이터 먼저 만들기 (dic)
# city 라는 열 하나
data = {'city':['서울','인천'],
        'pop':[990,240]
        }

# city, pop 열 두개를 담은 데이터 프레임 생성
# pd.DataFrame(값, [인덱스], [컬럼])
df = pd.DataFrame(data)
df

  city  pop
0   서울  990
1   인천  240

In [35]:
# 행열의 이름을 따로 설정하지 않으면 자동으로 설정됨
print(df.index) # 행 이름: 0,1
print(df.columns) # 열 이름: dic의 key (city, pop)

RangeIndex(start=0, stop=2, step=1)
Index(['city', 'pop'], dtype='object')

In [42]:
# 학생 성적 데이터 만들기
# dic, list
# 넘파이의 다차원 배열 사용하여 2차원 배열 생성
data = np.array([[60,70,80], [70,80,90], [80,90,100]])

# 성적 데이터를 담아서 데이터 프레임 생성
# 이 점수가 누구의 어떤 점수인지 알기 위해 이름표 붙이기
# 행: 학생이름
# 열: 과목명
df = pd.DataFrame(data, 
                  index=['둘리','또치','도우너'], 
                  columns=['국어','영어','수학'])
df.index
df.columns

Index(['국어', '영어', '수학'], dtype='object')

In [48]:
print(df)

df.loc[:, :]
df.loc['둘리', '국어']
df.loc['도우너','수학']

df['영어']

     국어  영어   수학
둘리   60  70   80
또치   70  80   90
도우너  80  90  100

둘리     70
또치     80
도우너    90
Name: 영어, dtype: int64

In [50]:
# df['과학'] = [60,70,80]
# df

     국어  영어   수학  과학
둘리   60  70   80  60
또치   70  80   90  70
도우너  80  90  100  80

In [51]:
df.insert(2, '미술', [70,80,90])
df

     국어  영어  미술   수학  과학
둘리   60  70  70   80  60
또치   70  80  80   90  70
도우너  80  90  90  100  80

In [52]:
# del df['과학']
# df

     국어  영어  미술   수학
둘리   60  70  70   80
또치   70  80  80   90
도우너  80  90  90  100

In [62]:
# df = df.drop('수학', axis=1) #엑시스(축, 방향)
# df

df = df.drop('또치', axis=0) #drop 함수는 원본에 영향이 없다.
df

     국어  영어  미술
둘리   60  70  70
도우너  80  90  90